{
  "nodes": [
    {
      "op": "null", 
      "name": "/conv2d_1_input1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(0, 28, 28, 1)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose3", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(3L, 3L, 1L, 32L)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose4", 
      "attrs": {"axes": "(3, 2, 0, 1)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_1/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3L, 3L)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose5", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(32L,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose9", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(3L, 3L, 32L, 64L)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose10", 
      "attrs": {"axes": "(3, 2, 0, 1)"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv2d_2/conv2d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3L, 3L)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose11", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2d_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(64L,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose14", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "max_pooling2d_1/pool2d2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose15", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_1/dropout2", 
      "attrs": {"p": "0.25"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(9216L, 128L)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot1", 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu5", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_2/dropout2", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L, 10L)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot3", 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(10L,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax1", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[31, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 6, 10, 14, 22, 24, 28, 30], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35
  ], 
  "heads": [[32, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}